<script>

export default {
  props: {
    visible: {
      type: Boolean,
      require: true
    }
  },
  methods: {
    closeModal() {
      this.$emit('close-modal')
    },
    accept() {
      this.closeModal();
      this.$emit('accept')
    }
  },
}
</script>

<template>
  <div v-if="visible"
       @click="closeModal"
       class="medics__overlay animate__animated animate__fadeIn">
  </div>
  <div v-if="visible" class="approval animate__animated animate__fadeInRight">
    <div class="approval__title">
      <span style="font-weight: 400;">Согласие на обработку персональных данных (далее &ndash; &laquo;согласие&raquo;)</span>
    </div>
    <div class="approval__content">
      <div>
        <ol>
          <li><span style="font-weight: 400;"> Настоящим я, во исполнение требований Федерального закона от 27.07.2006 г. № 152-ФЗ &laquo;О персональных данных&raquo; (с изменениями и дополнениями), Федерального закона от 13.03.2006 N 38-ФЗ &laquo;О рекламе&raquo; (с изменениями и дополнениями), свободно, своей волей и в своем интересе даю свое согласие ООО&nbsp; &laquo;Трансавто-7&raquo;&nbsp; (ОГРН 1149204036123) (далее &ndash; &laquo;Оператор&raquo;) на обработку своих персональных данных, указанных при регистрации, биометрических персональных данных, </span><span style="font-weight: 400;">характеризующих физиологические и биологические особенности человека</span><span style="font-weight: 400;"> при прохождении предрейсового/предсменного, послерейсового/послесменного медицинского осмотра </span><span style="font-weight: 400;">с использованием медицинских изделий, обеспечивающих автоматизированную дистанционную передачу информации о состоянии здоровья и дистанционный контроль состояния здоровья</span><span style="font-weight: 400;"> путем заполнения веб-формы на сайте Оператора и его поддоменов (далее &ndash; &laquo;Сайт&raquo;), направляемой (заполненной) с использованием Сайта; а также даю свое согласие на осуществление фотовидеофиксации для проведения идентификации личности и измерений.</span></li>
          <li><span style="font-weight: 400;"> Настоящим я, во исполнение требований Федерального закона от 27.07.2006 г. № 152-ФЗ &laquo;О персональных данных&raquo; (с изменениями и дополнениями), Федерального закона от 13.03.2006 N 38-ФЗ &laquo;О рекламе&raquo; (с изменениями и дополнениями), свободно, своей волей и в своем интересе даю свое согласие ООО&nbsp; &laquo;Трансавто-7&raquo;&nbsp; (ОГРН 1149204036123) (далее &ndash; &laquo;Оператор&raquo;) на обработку своих персональных данных, указанных при регистрации, биометрических персональных данных, </span><span style="font-weight: 400;">характеризующих физиологические и биологические особенности человека</span><span style="font-weight: 400;"> при прохождении предрейсового/предсменного, послерейсового/послесменного медицинского осмотра </span><span style="font-weight: 400;">с использованием медицинских изделий, обеспечивающих автоматизированную дистанционную передачу информации о состоянии здоровья и дистанционный контроль состояния здоровья</span><span style="font-weight: 400;"> путем заполнения веб-формы на сайте Оператора и его поддоменов (далее &ndash; &laquo;Сайт&raquo;), направляемой (заполненной) с использованием Сайта; а также даю свое согласие на осуществление фотовидеофиксации для проведения идентификации личности и измерений.</span></li>
          <li><span style="font-weight: 400;"> Я согласен с тем, что в рамках обработки персональных данных&nbsp; Оператор&nbsp; вправе осуществлять сбор, запись, систематизацию, накопление, анализ, использование, извлечение, передачу, получение, обработку</span><span style="font-weight: 400;"> в биометрических системах идентификации,</span> <span style="font-weight: 400;">хранение, уточнение (обновление, изменение), обезличивание, блокирование, удаление, уничтожение моих персональных данных путем ведения баз данных автоматизированным, механическим, ручным способами в целях:</span></li>
        </ol>
        <ul>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Прохождения предрейсового/предсменного, послерейсового/послесменного медицинского осмотра </span><span style="font-weight: 400;">с использованием медицинских изделий, обеспечивающих автоматизированную дистанционную передачу информации</span><span style="font-weight: 400;">;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Связи с технической поддержкой Оператора;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Предоставления поддержки при пользовании Сайтом;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Реализации и оказания телемедицинских услуг;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Технической поддержки при обработке информации, документации и персональных данных с использованием средств автоматизации и без такого использования.</span></li>
        </ul>
        <p><span style="font-weight: 400;">Перечень моих персональных данных, на обработку которых я даю согласие:</span></p>
        <ul>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Фамилия, имя, отчество;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Контактный телефон;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Адрес электронной почты;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Пол;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Возраст;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Паспортные данные;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">СНИЛС;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">ИНН;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Место работы и связанная с этим информация;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Адрес проживания;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Водительское удостоверение;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Показатели здоровья;</span></li>
          <li style="font-weight: 400;"><span style="font-weight: 400;">Аудиозаписи:&nbsp; разговора с сотрудниками тех. поддержки; и (или) системы автоматической записи; и (или) разговора с сотрудниками Оператора; а также фото - и видеоматериал.</span></li>
        </ul>
        <ol start="3">
          <li><span style="font-weight: 400;"> Я выражаю согласие и разрешаю Оператору объединять персональные данные в информационную систему персональных данных и обрабатывать мои персональные данные с помощью средств автоматизации либо без использования средств автоматизации </span><span style="font-weight: 400;">в биометрических системах идентификации</span><span style="font-weight: 400;">,</span><span style="font-weight: 400;"> а также с помощью иных программных средств, специально разработанных по поручению Оператора. Работа с информационными системами персональных данных осуществляется по предписанному Оператору алгоритму (сбор, систематизация, накопление, хранение, уточнение, использование, блокирование, уничтожение, др.). Используемые способы обработки, включая, но не ограничиваясь: уточнение данных со мной (посредством почтовой связи, электронной почты, телефонной связи (включая мобильную связь), факсимильной связи, сети Интернет), сегментация информационной базы по заданным критериям, периодические контакты со мной посредством телефонной связи (включая мобильную связь), посредством электронной почты или сети Интернет.&nbsp;</span></li>
          <li><span style="font-weight: 400;"> Настоящим я уведомлен Оператором о том, что предполагаемыми пользователями персональных данных являются работники Оператора, технической поддержки, партнеры Оператора.</span></li>
          <li><span style="font-weight: 400;"> Я ознакомлен(а), что:</span></li>
        </ol>
        <p><span style="font-weight: 400;">- настоящее согласие на обработку моих персональных данных является бессрочным и может быть отозвано посредством направления в адрес Оператора письменного заявления, в том числе на электронную почту office@transavto7.ru. Датой отзыва считается день, следующий за днём вручения Оператору письменного заявления об отзыве согласия на обработку персональных данных;</span><span style="font-weight: 400;"><br /></span><span style="font-weight: 400;">- имею право на доступ к своим персональным данным, требовать уточнения (обновление, изменение) моих персональных данных, а также удаления и уничтожения моих персональных данных в случае их обработки Оператором, нарушающих мои законные права и интересы, законодательство Российской Федерации.&nbsp;</span></p>
        <ol start="6">
          <li><span style="font-weight: 400;"> Я обязуюсь в случае изменения моих персональных данных, сведений обо мне незамедлительно сообщать Оператору с предоставлением подтверждающих документов.</span></li>
          <li><span style="font-weight: 400;"> Настоящее Согласие признается мной, Оператором моим письменным согласием на обработку моих персональных данных; а также на осуществление Оператором фотовидеофиксации.</span></li>
          <li><span style="font-weight: 400;"> Настоящим Согласием я подтверждаю, что являюсь субъектом предоставляемых персональных данных, а также подтверждаю достоверность предоставляемых данных.</span></li>
        </ol>
      </div>
      <button @click="accept" class="btn animate__animated animate__fadeInUp">Принять</button>
    </div>
  </div>

</template>